---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalDemandFactorParam
source: html/3ee1e9dc-eb78-7089-8bde-c1d928b26fe3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalDemandFactorParam Property

"Total Demand Factor"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalDemandFactorParam { get; }
```